src/cf/InformationRegisters/пбп_СоответствиеОбъектовИнтегрируемыхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>пбп_СоответствиеОбъектовИнтегрируемыхСистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДополнительныйИдентификатор</Name>
					<Comment>Номер, код и пр. интегрируемой системы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнтегрируемаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтегрируемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнтеграционныйПоток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтеграционныеПотоки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_ОбъектыИнтегрируемыхСистем</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСистемы</Name>
					<Comment>Уникальный идентификатор (uuid) или значение поля, гарантирующее уникальность записи (например, автоинкремент)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/пбп_ИсторияЗагрузкиФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>пбп_ИсторияЗагрузкиФайлов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнтеграционныйПоток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтеграционныеПотоки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/пбп_ФорматыИнтеграций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>пбп_ФорматыИнтеграций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JSON</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйФормат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CSV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BATSH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DLL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/пбп_НаправленияИнтеграционныхПотоков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>пбп_НаправленияИнтеграционныхПотоков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Служебный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/пбп_СтатусыИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>пбп_СтатусыИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗагрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Служебный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСлужебного</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/пбп_СозданОбновлен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>пбп_СозданОбновлен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обновлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСоздания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбновления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/пбп_ИсторияИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>пбп_ИсторияИнтеграции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнтеграции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнтеграцииВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВызова</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтеграционныйПоток</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтеграционныеПотоки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтегрируемаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИнтегрируемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.пбп_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязьИстории</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.пбп_ИсторияИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_СтатусыИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматИнтеграции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.пбп_ФорматыИнтеграций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыИнтеграции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектИнтеграции</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИдентификатора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СозданОбновлен</Name>
							<Type>
								<v8:Type>cfg:EnumRef.пбп_СозданОбновлен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВерсии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоЗаписьРегистра</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборыРегистра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/пбп_ТипыИнтеграций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>пбп_ТипыИнтеграций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметрыНастроекИнтеграций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/пбп_ИнтеграцииСлужебный/Ext/Module.bsl
// Библиотека проектных подсистем для упрощения разработки архитектуры на 1С: Предприятие 8,
// включая доработку типовых конфигураций.
//
// Copyright First BIT company
//
//   Licensed under the Apache License, Version 2.0 (the "License");
//   you may not use this file except in compliance with the License.
//   You may obtain a copy of the License at
//
//       http://www.apache.org/licenses/LICENSE-2.0
//
//   Unless required by applicable law or agreed to in writing, software
//   distributed under the License is distributed on an "AS IS" BASIS,
//   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//   See the License for the specific language governing permissions and
//   limitations under the License.
//
// URL:    https://github.com/firstBitSportivnaya/PSSL/
//

#Область СлужебныйПрограммныйИнтерфейс

#Область ИсторияИнтеграции

// Функция возвращает структуру со всеми необходимыми значениями для заполнения записи истории интеграции
//
// Возвращаемое значение:
//  Структура - описание свойств истории интеграции
//
Функция ПолучитьСтруктуруЗаписиИстории() Экспорт
	
	СтруктураЗаписиИстории = Новый Структура;
	СтруктураЗаписиИстории.Вставить("ИнтеграционныйПоток",		Неопределено);
	СтруктураЗаписиИстории.Вставить("ВходящееСообщение",		"");
	СтруктураЗаписиИстории.Вставить("ИсходящееСообщение",		"");
	СтруктураЗаписиИстории.Вставить("ИнтегрируемаяСистема",		Неопределено);
	СтруктураЗаписиИстории.Вставить("ОписаниеОшибки",			"");
	СтруктураЗаписиИстории.Вставить("ПротоколОбмена",			"");
	СтруктураЗаписиИстории.Вставить("ДатаНачалаИнтеграции",		ТекущаяДатаСеанса());
	СтруктураЗаписиИстории.Вставить("ДлительностьВызова",		0);
	СтруктураЗаписиИстории.Вставить("ФорматИнтеграции",			Перечисления.пбп_ФорматыИнтеграций.XML);
	СтруктураЗаписиИстории.Вставить("ИмяФайлаСообщения",		"");
	СтруктураЗаписиИстории.Вставить("ФайлСообщения",			Неопределено);
	СтруктураЗаписиИстории.Вставить("СвязьИстории",				Справочники.пбп_ИсторияИнтеграции.ПустаяСсылка());
	СтруктураЗаписиИстории.Вставить("ОбрабатыватьСообщение",	Истина);
	СтруктураЗаписиИстории.Вставить("ГенерироватьПротокол",		Ложь);
	СтруктураЗаписиИстории.Вставить("ОбъектыИнтеграции",		ИнициализироватьТаблицуОбъектовИнтеграции());
	
	Возврат СтруктураЗаписиИстории;
	
КонецФункции

// Инициализировать таблицу объектов интеграции
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с колонками для заполнения объектов интеграции
//
Функция ИнициализироватьТаблицуОбъектовИнтеграции() Экспорт
	
	ОбъектыИнтеграции = Новый ТаблицаЗначений;
	ОбъектыИнтеграции.Колонки.Добавить("ОбъектИнтеграции", пбп_ПереадресацияПовтИсп.ОписаниеТипаВсеСсылки());
	ОбъектыИнтеграции.Колонки.Добавить("Идентификатор", пбп_Переадресация.ОписаниеТипаСтрока(100));
	ОбъектыИнтеграции.Колонки.Добавить("ТипИдентификатора", пбп_Переадресация.ОписаниеТипаСтрока(30));
	ОбъектыИнтеграции.Колонки.Добавить("СозданОбновлен", Новый ОписаниеТипов("ПеречислениеСсылка.пбп_СозданОбновлен"));
	ОбъектыИнтеграции.Колонки.Добавить("ДополнительнаяИнформация", пбп_Переадресация.ОписаниеТипаСтрока(200));
	ОбъектыИнтеграции.Колонки.Добавить("НомерВерсии", пбп_Переадресация.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
	
	Возврат ОбъектыИнтеграции;
	
КонецФункции

// Функция создает запись справочника История интеграции с информацией о событии интеграции
//
// Параметры:
//  СтруктураЗаписиИстории	 - Структура - описание действия (см. ПолучитьСтруктуруЗаписиИстории)
// 
// Возвращаемое значение:
//  СправочникСсылка.пбп_ИсторияИнтеграции - ссылка на созданный справочник
//
Функция СоздатьСообщениеИсторииИнтеграции(СтруктураЗаписиИстории) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СтруктураЗаписиИстории.ОбрабатыватьСообщение Тогда
		ДополнительноОбработатьЗапросыИнтеграцииПередЗаписьюВИсторию(СтруктураЗаписиИстории);
	КонецЕсли;
	
	Если СтруктураЗаписиИстории.ГенерироватьПротокол Тогда
		СгенерироватьПротоколОбменаПоОбъектамИнтеграции(СтруктураЗаписиИстории);
	КонецЕсли;
	
	НовоеСообщение = Справочники.пбп_ИсторияИнтеграции.СоздатьЭлемент();
	НовоеСообщение.ДатаИнтеграции = ТекущаяДатаСеанса();
	НовоеСообщение.ДатаИнтеграцииВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НовоеСообщение.Код = Новый УникальныйИдентификатор();
	НовоеСообщение.Ошибка = ЗначениеЗаполнено(СтруктураЗаписиИстории.ОписаниеОшибки);
	НовоеСообщение.Пользователь = пбп_Переадресация.ТекущийПользователь();
	НовоеСообщение.ДлительностьОбмена = НовоеСообщение.ДатаИнтеграции - СтруктураЗаписиИстории.ДатаНачалаИнтеграции;
	НовоеСообщение.ДлительностьВызова = СтруктураЗаписиИстории.ДлительностьВызова;
	
	НаправлениеПотока = СтруктураЗаписиИстории.ИнтеграционныйПоток.НаправлениеПотока;
	Если НаправлениеПотока = Перечисления.пбп_НаправленияИнтеграционныхПотоков.Входящий Тогда
		Если НовоеСообщение.Ошибка Тогда
			НовоеСообщение.Статус = Перечисления.пбп_СтатусыИнтеграции.ОшибкаЗагрузки;
		Иначе
			НовоеСообщение.Статус = Перечисления.пбп_СтатусыИнтеграции.Загружено;
		КонецЕсли;
	ИначеЕсли НаправлениеПотока = Перечисления.пбп_НаправленияИнтеграционныхПотоков.Исходящий Тогда
		Если НовоеСообщение.Ошибка Тогда
			НовоеСообщение.Статус = Перечисления.пбп_СтатусыИнтеграции.ОшибкаВыгрузки;
		Иначе
			НовоеСообщение.Статус = Перечисления.пбп_СтатусыИнтеграции.Выгружено;
		КонецЕсли;
	Иначе
		Если НовоеСообщение.Ошибка Тогда
			НовоеСообщение.Статус = Перечисления.пбп_СтатусыИнтеграции.ОшибкаСлужебного;
		Иначе
			НовоеСообщение.Статус = Перечисления.пбп_СтатусыИнтеграции.Служебный;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовоеСообщение, СтруктураЗаписиИстории);
	
	Если НовоеСообщение.ИнтеграционныйПоток.ХранитьНомераВерсий Тогда
		ЗаполнитьНомераВерсийОбъектовИнтеграции(
			НовоеСообщение.ДатаИнтеграции,
			НовоеСообщение.Пользователь,
			СтруктураЗаписиИстории.ОбъектыИнтеграции);
	КонецЕсли;
	
	Для Каждого Строка Из СтруктураЗаписиИстории.ОбъектыИнтеграции Цикл
		НоваяСтрока = НовоеСообщение.ОбъектыИнтеграции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;
	
	НовоеСообщение.Записать();
	
	Возврат НовоеСообщение.Ссылка;
	
КонецФункции

// Процедура добавляет сообщения в протокол обмена через указанный разделитель
// 
// Параметры:
//  СтруктураОтвета - Структура - см. ИнтеграцииСервер.ПолучитьСтруктуруЗаписиИстории
//  ТекстСообщения - Строка - Текст, который будет записан в протокол обмена
//  Разделитель - Строка - Разделитель записей
Процедура ДобавитьЗаписьВПротоколОбмена(СтруктураОтвета, ТекстСообщения, Разделитель = "") Экспорт
	
	Если ПустаяСтрока(Разделитель) Тогда
		Разделитель = ";" + Символы.ПС;
	КонецЕсли;
	
	ВыводРазделителя = ?(ПустаяСтрока(СтруктураОтвета.ПротоколОбмена), "", Разделитель);
	
	СтруктураОтвета.ПротоколОбмена = СтруктураОтвета.ПротоколОбмена + ВыводРазделителя + НСтр(ТекстСообщения);
	
КонецПроцедуры

// Получает представление текста запроса внешнего источника данных
//
// Параметры:
//  Запрос - Строка - текст запроса к таблице внешнего источника данных с добавлением значений параметров в текст
// 
// Возвращаемое значение:
//  Строка - текст запроса с заполненными значениями параметров
//
Функция ПолучитьПредставлениеТекстЗапросаВнешнегоИсточникаДанных(Запрос) Экспорт
	
	ПредставлениеТекстаЗапроса = Запрос.Текст;
	
	Для Каждого ПараметрЗапроса Из Запрос.Параметры Цикл
		ТипЗначения = ТипЗнч(ПараметрЗапроса.Значение);
		Если ТипЗначения = Тип("Строка") Тогда
			ПредставлениеЗначения = """" + ПараметрЗапроса.Значение + """";
		ИначеЕсли ТипЗначения = Тип("Дата") Тогда
			ПредставлениеЗначения = "'" + Формат(ПараметрЗапроса.Значение, "ДЛФ=DT") + "'";
		ИначеЕсли ТипЗначения = Тип("Булево") Тогда
			ПредставлениеЗначения = Формат(ПараметрЗапроса.Значение, "БЛ=ЛОЖЬ; БИ=ИСТИНА");
		ИначеЕсли ТипЗначения = Тип("Массив") Тогда
			СтрокаСРазделителями = "";
			Для Каждого ЭлементМассива Из ПараметрЗапроса.Значение Цикл
				СтрокаСРазделителями = СтрокаСРазделителями
					+ ?(ПустаяСтрока(СтрокаСРазделителями), "", ",")
					+ СокрЛП(ЭлементМассива);
			КонецЦикла;
			ПредставлениеЗначения = СтрокаСРазделителями;
		Иначе
			ПредставлениеЗначения = Формат(ПараметрЗапроса.Значение, "ЧГ=");
		КонецЕсли;
		
		ПредставлениеТекстаЗапроса = СтрЗаменить(ПредставлениеТекстаЗапроса,
			"&" + ПараметрЗапроса.Ключ, ПредставлениеЗначения);
	КонецЦикла;
	
	Возврат ПредставлениеТекстаЗапроса;
	
КонецФункции

#КонецОбласти // ИсторияИнтеграции

#Область РаботаСДанными

// Возвращает структуру с настройками для интеграции
//
// Параметры:
//  НастройкаИнтеграции - СправочникСсылка.пбп_НастройкиИнтеграции - Ссылка на элемент справочника Настройки интеграции
//
// Возвращаемое значение:
//  Структура
Функция ПолучитьСтруктуруНастроекИнтеграции(НастройкаИнтеграции, ЗаполнитьДополнительныеНастройки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	пбп_НастройкиИнтеграции.ИнтегрируемаяСистема КАК ИнтегрируемаяСистема,
		|	пбп_НастройкиИнтеграции.СтрокаПодключения КАК СтрокаПодключения,
		|	пбп_НастройкиИнтеграции.Порт КАК Порт,
		|	пбп_НастройкиИнтеграции.ИмяОбъекта КАК ИмяОбъекта,
		|	пбп_НастройкиИнтеграции.ТипСУБД КАК ТипСУБД
		|ИЗ
		|	Справочник.пбп_НастройкиИнтеграции КАК пбп_НастройкиИнтеграции
		|ГДЕ
		|	пбп_НастройкиИнтеграции.Ссылка = &Ссылка";
	
	Если ЗаполнитьДополнительныеНастройки Тогда
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	пбп_НастройкиИнтеграцииДополнительныеНастройки.Идентификатор КАК Идентификатор,
			|	пбп_НастройкиИнтеграцииДополнительныеНастройки.Значение КАК Значение
			|ИЗ
			|	Справочник.пбп_НастройкиИнтеграции.ДополнительныеНастройки КАК пбп_НастройкиИнтеграцииДополнительныеНастройки
			|ГДЕ
			|	пбп_НастройкиИнтеграцииДополнительныеНастройки.Ссылка = &Ссылка";
		
		Запрос.Текст = Запрос.Текст + пбп_Переадресация.РазделительПакетаЗапросов() + ТекстЗапроса;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаИнтеграции);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНастройкиИнтеграции = РезультатыЗапроса[0].Выбрать();
	КолонкиНастроек = РезультатыЗапроса[0].Колонки;
	
	СтруктураНастроек = Новый Структура;
	Если ВыборкаНастройкиИнтеграции.Следующий() Тогда
		Для Каждого Колонка Из КолонкиНастроек Цикл
			СтруктураНастроек.Вставить(Колонка.Имя, ВыборкаНастройкиИнтеграции[Колонка.Имя]);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗаполнитьДополнительныеНастройки Тогда
		ВыборкаДопНастройки = РезультатыЗапроса[1].Выбрать();
		
		Пока ВыборкаДопНастройки.Следующий() Цикл
			СтруктураНастроек.Вставить(ВыборкаДопНастройки.Идентификатор, ВыборкаДопНастройки.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеБезопасногоХранилища = пбп_Переадресация.ПрочитатьДанныеИзБезопасногоХранилища(НастройкаИнтеграции);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(ДанныеБезопасногоХранилища) И ТипЗнч(ДанныеБезопасногоХранилища) = Тип("Структура") Тогда
		Для Каждого КлючИЗначение Из ДанныеБезопасногоХранилища Цикл
			СтруктураНастроек.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Возвращает структуру с настройками для интеграции
//
// Параметры:
//  ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки -
//  ссылка на элемент справочника интеграционные потоки
//
// Возвращаемое значение:
//  Структура
Функция ПолучитьСтруктуруПотокаИНастроекИнтеграции(ИнтеграционныйПоток) Экспорт
	
	СтруктураПотокаИНастроек = пбп_Переадресация.ЗначенияРеквизитовОбъекта(
		ИнтеграционныйПоток, "НастройкаИнтеграции, ТочкаВхода");
	СтруктураНастроек = ПолучитьСтруктуруНастроекИнтеграции(СтруктураПотокаИНастроек.НастройкаИнтеграции);
	пбп_ПереадресацияКлиентСервер.ДополнитьСтруктуру(СтруктураПотокаИНастроек, СтруктураНастроек);
	
	Возврат СтруктураПотокаИНастроек;
	
КонецФункции

// Получает структуру параметров интеграционного потока со значениями по умолчанию
//
// Параметры:
//  ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - ссылка на метод, параметры которого получаем.
//  ЗаполнятьПоУмолчанию - Булево - добавлять ли в возвращаемую структуру значения по умолчанию
//    - Ложь - возвращает структуру вида ИмяПараметра<Строка>:ТипЗначения<ПеречислениеСсылка.пбп_ТипыJSON>
//    - Истина - возвращает структуру вида ИмяПараметра<Строка>:ЗначениеПоУмолчанию<Строка>
//
// Возвращаемое значение:
//   Структура
//
Функция ПолучитьСтруктуруПараметровВхода(ИнтеграционныйПоток, ЗаполнятьПоУмолчанию = Ложь) Экспорт

	Возврат Справочники.пбп_ИнтеграционныеПотоки.ПолучитьСтруктуруПараметровВхода(
		ИнтеграционныйПоток, ЗаполнятьПоУмолчанию);

КонецФункции

// Получить ссылки в информационной базе по идентификаторам интегрируемой системы
//
// Параметры:
//  ИнтегрируемаяСистема	 - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//  МассивИдентификаторов	 - Массив - идентификаторы системы строкой
//  ИнтеграционныйПоток	     - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток (необязательно)
// 
// Возвращаемое значение:
//  ТаблицаЗначений - соответствие ИдентификаторСистемы и СсылкаНаОбъект
//
Функция ПолучитьСсылкиПоИдентификаторамСистем(ИнтегрируемаяСистема, МассивИдентификаторов,
	ИнтеграционныйПоток = Неопределено) Экспорт
	
	Если Не пбп_ОбщегоНазначенияСервер.ПолучитьЗначениеКонстанты(
		"пбп_ИспользоватьСоответствияОбъектовИнтегрируемыхСистем") Тогда
		ВызватьИсключение ПолучитьТекстОшибкиОтключенСоответствиеОбъектовИнтегрируемыхСистем();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru='Не указана интегрируемая система'");
	КонецЕсли;
	
	Если МассивИдентификаторов = Неопределено
		Или МассивИдентификаторов.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	пбп_СоответствиеОбъектовИнтегрируемыхСистем.ИдентификаторСистемы КАК ИдентификаторСистемы,
		|	пбп_СоответствиеОбъектовИнтегрируемыхСистем.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.пбп_СоответствиеОбъектовИнтегрируемыхСистем КАК пбп_СоответствиеОбъектовИнтегрируемыхСистем
		|ГДЕ
		|	пбп_СоответствиеОбъектовИнтегрируемыхСистем.ИнтегрируемаяСистема = &ИнтегрируемаяСистема
		|	И пбп_СоответствиеОбъектовИнтегрируемыхСистем.ИдентификаторСистемы В(&ИдентификаторСистемы)";
	
	Запрос.УстановитьПараметр("ИнтегрируемаяСистема", ИнтегрируемаяСистема);
	Запрос.УстановитьПараметр("ИдентификаторСистемы", МассивИдентификаторов);
	
	Если ЗначениеЗаполнено(ИнтеграционныйПоток) Тогда
		УсловияЗапроса = "пбп_СоответствиеОбъектовИнтегрируемыхСистем.ИнтеграционныйПоток = &ИнтеграционныйПоток";
		пбп_СхемыЗапросов.ДобавитьОтборВЗапрос(Запрос, УсловияЗапроса);
		
		Запрос.УстановитьПараметр("ИнтеграционныйПоток", ИнтеграционныйПоток);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получить ссылку на объект по идентификатору системы
//
// Параметры:
//  ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - ссылка на интегрируемую систему
//  Идентификато		 - Строка - идентификатор системы
//  ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток (необязательно)
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - ссылка на объект 1С
//
Функция ПолучитьСсылкуНаОбъектПоИдентификаторуСистемы(ИнтегрируемаяСистема, Идентификатор,
	ИнтеграционныйПоток = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru='Не указана интегрируемая система'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		ВызватьИсключение НСтр("ru='Не указан идентификатор интегрируемой системы'");
	КонецЕсли;
	
	МассивИдентификаторов = Новый Массив;
	МассивИдентификаторов.Добавить(Идентификатор);
	ИдентификаторСсылка = ПолучитьСсылкиПоИдентификаторамСистем(
		ИнтегрируемаяСистема, МассивИдентификаторов, ИнтеграционныйПоток);
	Если ИдентификаторСсылка.Количество() Тогда
		СсылкаНаОбъект = ИдентификаторСсылка[0].СсылкаНаОбъект;
	Иначе
		СсылкаНаОбъект = Неопределено;
	КонецЕсли;
	
	Возврат СсылкаНаОбъект;
	
КонецФункции

// Получить дополнительные идентификаторы из соответствия объектов систем
//
// Параметры:
//  ИнтегрируемаяСистема - СправочникСсылка.пбп_ИнтегрируемыеСистемы - ссылка на интегрируемую систему
//  МассивСсылок		 - Массив - ссылки на объекты регистра соответствия объектов интегрируемых систем
//  ИнтеграционныйПоток - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток (необязательно)
// 
// Возвращаемое значение:
//  ТаблицаЗначений - соответствия ссылка - дополнительный номер
//
Функция ПолучитьДополнительныеИдентификаторыИзСоответствияОбъектовСистем(ИнтегрируемаяСистема, МассивСсылок,
	ИнтеграционныйПоток = Неопределено) Экспорт
	
	Если Не пбп_ОбщегоНазначенияСервер.ПолучитьЗначениеКонстанты(
		"пбп_ИспользоватьСоответствияОбъектовИнтегрируемыхСистем") Тогда
		ВызватьИсключение ПолучитьТекстОшибкиОтключенСоответствиеОбъектовИнтегрируемыхСистем();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru='Не указана интегрируемая система'");
	КонецЕсли;
	
	Если МассивСсылок = Неопределено
		Или МассивСсылок.Количество() = 0 Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИнтегрируемаяСистема", ИнтегрируемаяСистема);
	Запрос.УстановитьПараметр("СсылкиНаОбъекты", МассивСсылок);
	Если ЗначениеЗаполнено(ИнтеграционныйПоток) Тогда
		Запрос.УстановитьПараметр("ИнтеграционныйПоток", ИнтеграционныйПоток);
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	|	пбп_СоответствиеОбъектовИнтегрируемыхСистем.ДополнительныйИдентификатор КАК ДополнительныйИдентификатор,
	|	пбп_СоответствиеОбъектовИнтегрируемыхСистем.СсылкаНаОбъект КАК СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.пбп_СоответствиеОбъектовИнтегрируемыхСистем КАК пбп_СоответствиеОбъектовИнтегрируемыхСистем
	|ГДЕ
	|	пбп_СоответствиеОбъектовИнтегрируемыхСистем.ИнтегрируемаяСистема = &ИнтегрируемаяСистема
	|	И пбп_СоответствиеОбъектовИнтегрируемыхСистем.СсылкаНаОбъект В(&СсылкиНаОбъекты)";
	
	Если ЗначениеЗаполнено(ИнтеграционныйПоток) Тогда
		Запрос.Текст = Запрос.Текст
			+ "
	|	И пбп_СоответствиеОбъектовИнтегрируемыхСистем.ИнтеграционныйПоток = &ИнтеграционныйПоток";
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Добавляет соответствия объектов 1С и идентификаторов интегрируемых систем
//
// Параметры:
//  ИнтегрируемаяСистема	 - СправочникСсылка.пбп_ИнтегрируемыеСистемы - интегрируемая система
//  ТаблицаСоответствий		 - ТаблицаЗначений - см. ИнициализироватьТаблицуСоответствийОбъектовИнтегрируемыхСистем
//
Процедура ДобавитьСоответствияОбъектовИнтегрируемыхСистем(ИнтегрируемаяСистема, ТаблицаСоответствий) Экспорт
	
	Если Не пбп_ОбщегоНазначенияСервер.ПолучитьЗначениеКонстанты(
		"пбп_ИспользоватьСоответствияОбъектовИнтегрируемыхСистем") Тогда
		ВызватьИсключение ПолучитьТекстОшибкиОтключенСоответствиеОбъектовИнтегрируемыхСистем();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИнтегрируемаяСистема) Тогда
		ВызватьИсключение НСтр("ru='Не указана интегрируемая система'");
	КонецЕсли;
	
	Если ТаблицаСоответствий = Неопределено
		Или ТаблицаСоответствий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РазмерПакета = 1000; // Оптимальный размер пакета
	КоличествоЗаписей = ТаблицаСоответствий.Количество();
	
	Для НомерПакета = 0 По Цел(КоличествоЗаписей / РазмерПакета) Цикл
		НачалоПакета = НомерПакета * РазмерПакета;
		КонецПакета = Мин(НачалоПакета + РазмерПакета - 1, КоличествоЗаписей - 1);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.пбп_СоответствиеОбъектовИнтегрируемыхСистем");
		ЭлементБлокировки.УстановитьЗначение("ИнтегрируемаяСистема", ИнтегрируемаяСистема);
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.пбп_СоответствиеОбъектовИнтегрируемыхСистем.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИнтегрируемаяСистема.Установить(ИнтегрируемаяСистема);
			НаборЗаписей.Прочитать();
			
			Для Индекс = НачалоПакета По КонецПакета Цикл
				СтрокаСоответствие = ТаблицаСоответствий[Индекс];
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ИнтегрируемаяСистема        = ИнтегрируемаяСистема;
				Если ТаблицаСоответствий.Колонки.Найти("ИнтеграционныйПоток") <> Неопределено
					И ЗначениеЗаполнено(СтрокаСоответствие.ИнтеграционныйПоток) Тогда
					НоваяЗапись.ИнтеграционныйПоток = СтрокаСоответствие.ИнтеграционныйПоток;
				КонецЕсли;
				НоваяЗапись.СсылкаНаОбъект              = СтрокаСоответствие.СсылкаНаОбъект;
				НоваяЗапись.ИдентификаторСистемы        = СтрокаСоответствие.ИдентификаторСистемы;
				НоваяЗапись.ДополнительныйИдентификатор = СтрокаСоответствие.ДополнительныйИдентификатор;
			КонецЦикла;
			
			НаборЗаписей.Записать();
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Получить текст ошибки отключен соответствие объектов интегрируемых систем
// 
// Возвращаемое значение:
//  Строка - текст ошибки
//
Функция ПолучитьТекстОшибкиОтключенСоответствиеОбъектовИнтегрируемыхСистем() Экспорт
	Возврат НСтр("ru='Использование регистра для хранения соответствий объектов интегрируемых систем отключено'");
КонецФункции

// Инициализировать таблицу соответствий объектов интегрируемых систем
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с типизированными колонками для заполнения соответствий
//
Функция ИнициализироватьТаблицуСоответствийОбъектовИнтегрируемыхСистем() Экспорт
	
	ТаблицаСоответствий = Новый ТаблицаЗначений;
	ТаблицаСоответствий.Колонки.Добавить("ИдентификаторСистемы", пбп_Переадресация.ОписаниеТипаСтрока(100));
	
	ТипыМетаданные = Метаданные.ОпределяемыеТипы.пбп_ОбъектыИнтегрируемыхСистем;
	МассивТипов = ТипыМетаданные.Тип.Типы();
	ТаблицаСоответствий.Колонки.Добавить("ИнтеграционныйПоток",
		Новый ОписаниеТипов("СправочникСсылка.пбп_ИнтеграционныеПотоки"));
	ТаблицаСоответствий.Колонки.Добавить("СсылкаНаОбъект", Новый ОписаниеТипов(МассивТипов));
	ТаблицаСоответствий.Колонки.Добавить("ДополнительныйИдентификатор", пбп_Переадресация.ОписаниеТипаСтрока(50));
	
	Возврат ТаблицаСоответствий;
	
КонецФункции

// Получить историю загруженных файлов по интеграционному потоку
//
// Параметры:
//  ИнтеграционныйПоток	 - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток, по которому необходимо получить историю
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с данными по загруженным файлам
//
Функция ПолучитьИсториюЗагруженныхФайловПоИнтеграционномуПотоку(ИнтеграционныйПоток) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИнтеграционныйПоток", ИнтеграционныйПоток);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	пбп_ИсторияЗагрузкиФайлов.ИмяФайла КАК ИмяФайла,
	|	пбп_ИсторияЗагрузкиФайлов.Обработан КАК Обработан
	|ИЗ
	|	РегистрСведений.пбп_ИсторияЗагрузкиФайлов КАК пбп_ИсторияЗагрузкиФайлов
	|ГДЕ
	|	пбп_ИсторияЗагрузкиФайлов.ИнтеграционныйПоток = &ИнтеграционныйПоток";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Добавляет записи в историю по загруженным в систему файлам
//
// Параметры:
//  ИнтеграционныйПоток	 - СправочникСсылка.пбп_ИнтеграционныеПотоки - интеграционный поток
//  ТаблицаСоответствий	 - ТаблицаЗначений - см. ИнициализироватьТаблицуИсторииЗагрузкиФайлов
//
Процедура ДобавитьЗаписиИсторииЗагрузкиФайлов(ИнтеграционныйПоток, ТаблицаИстории) Экспорт
	
	Если Не ЗначениеЗаполнено(ИнтеграционныйПоток) Тогда
		ВызватьИсключение НСтр("ru='Не указан интеграционный поток'");
	КонецЕсли;
	
	Если ТаблицаИстории = Неопределено
		Или ТаблицаИстории.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.пбп_ИсторияЗагрузкиФайлов");
	ЭлементБлокировки.УстановитьЗначение("ИнтеграционныйПоток", ИнтеграционныйПоток);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.пбп_ИсторияЗагрузкиФайлов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИнтеграционныйПоток.Установить(ИнтеграционныйПоток);
		НаборЗаписей.Прочитать();
		
		Для Каждого СтрокаИстории Из ТаблицаИстории Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период				= СтрокаИстории.Период;
			НоваяЗапись.ИнтеграционныйПоток	= ИнтеграционныйПоток;
			НоваяЗапись.ИмяФайла			= СтрокаИстории.ИмяФайла;
			НоваяЗапись.Обработан			= СтрокаИстории.Обработан;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Инициализировать таблицу истории загрузки файлов
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица с типизированными колонками для заполнения истории загрузки файлов
//
Функция ИнициализироватьТаблицуИсторииЗагрузкиФайлов() Экспорт
	
	ИсторияЗагрузки = Новый ТаблицаЗначений;
	ИсторияЗагрузки.Колонки.Добавить("Период", Новый ОписаниеТипов(
		"Дата", , , , ,  Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ИсторияЗагрузки.Колонки.Добавить("ИмяФайла", пбп_Переадресация.ОписаниеТипаСтрока(100));
	ИсторияЗагрузки.Колонки.Добавить("Обработан", Новый ОписаниеТипов("Булево"));
	
	Возврат ИсторияЗагрузки;
	
КонецФункции

// Проверить это интеграция с внешним источником данных
//
// Параметры:
//  ТипИнтеграции	 - СправочникСсылка.пбп_ТипыИнтеграций - тип интеграции
// 
// Возвращаемое значение:
//  Булево - Истина, если настройка интеграции с типом интеграция с внешним источником данных
//
Функция ПроверитьЭтоИнтеграцияСВнешнимИсточникомДанных(ТипИнтеграции) Экспорт
	
	ЭлементНаследования = Справочники.пбп_ТипыИнтеграций
		.ПолучитьПредопределенныйЭлементНаследованияНастроекТипаИнтеграции(ТипИнтеграции);
	
	Возврат ЭлементНаследования = Справочники.пбп_ТипыИнтеграций.ПрямоеПодключениеКБД;
	
КонецФункции

#КонецОбласти // РаботаСДанными

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Процедура обрабатывает запросы в структуре записи истории
//
// Параметры:
//  СтруктураЗаписиИстории - Структура - см. ПолучитьСтруктуруЗаписиИстории
//
Процедура ДополнительноОбработатьЗапросыИнтеграцииПередЗаписьюВИсторию(СтруктураЗаписиИстории)
	
	Если СтруктураЗаписиИстории.ФорматИнтеграции = Перечисления.пбп_ФорматыИнтеграций.XML Тогда
		Если Не ПустаяСтрока(СтруктураЗаписиИстории.ИсходящееСообщение)
			И СтрНайти(СтруктураЗаписиИстории.ИсходящееСообщение, "xml") <> 0 Тогда
			
			ОчиститьДлинныеАтрибутыСообщенияXML(СтруктураЗаписиИстории.ИсходящееСообщение);
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтруктураЗаписиИстории.ВходящееСообщение)
			И СтрНайти(СтруктураЗаписиИстории.ВходящееСообщение, "xml") <> 0 Тогда
			
			ОчиститьДлинныеАтрибутыСообщенияXML(СтруктураЗаписиИстории.ВходящееСообщение);
			
		КонецЕсли;
		
	ИначеЕсли СтруктураЗаписиИстории.ФорматИнтеграции = Перечисления.пбп_ФорматыИнтеграций.JSON Тогда
		Если Не ПустаяСтрока(СтруктураЗаписиИстории.ИсходящееСообщение) Тогда
			Объект = пбп_КоннекторHTTP.JsonВОбъект(СтруктураЗаписиИстории.ИсходящееСообщение);
			СтруктураЗаписиИстории.ИсходящееСообщение = пбп_КоннекторHTTP.ОбъектВJson(Объект);
		КонецЕсли;
		
		Если Не ПустаяСтрока(СтруктураЗаписиИстории.ВходящееСообщение) Тогда
			Объект = пбп_КоннекторHTTP.JsonВОбъект(СтруктураЗаписиИстории.ВходящееСообщение);
			СтруктураЗаписиИстории.ВходящееСообщение = пбп_КоннекторHTTP.ОбъектВJson(Объект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура очищает XML строку от длинных записей (например base64 строк)
//
// Параметры:
//  XMLСтрока - Строка - XML-текст, которые необходимо преобразовать
//
Процедура ОчиститьДлинныеАтрибутыСообщенияXML(XMLСтрока)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(XMLСтрока);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ТребуетсяПерезаписатьXML = Ложь;
	
	// Перебрать все узлы
	МаксимальныйРазмерСтроки = 1000;
	ИтераторДерева = Новый ОбходДереваDOM(ДокументDOM);
	Пока ИтераторДерева.СледующийУзел() <> Неопределено Цикл
		Если ТипЗнч(ИтераторДерева.ТекущийУзел) = Тип("ЭлементDOM") Тогда
			Если СтрДлина(ИтераторДерева.ТекущийУзел.ТекстовоеСодержимое) > МаксимальныйРазмерСтроки Тогда
				ИтераторДерева.ТекущийУзел.ТекстовоеСодержимое = "X";
				ТребуетсяПерезаписатьXML = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ТребуетсяПерезаписатьXML Тогда
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку(Новый ПараметрыЗаписиXML(, , Истина, Истина));
		
		ЗаписьDOM = Новый ЗаписьDOM;
		ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
		
		XMLСтрока = ЗаписьXML.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СгенерироватьПротоколОбменаПоОбъектамИнтеграции(СтруктураЗаписиИстории)
	
	ПрошлыйТип = Неопределено;
	Для Каждого СтрокаОбъекта Из СтруктураЗаписиИстории.ОбъектыИнтеграции Цикл
		
		ТипЗначения = ТипЗнч(СтрокаОбъекта.ОбъектИнтеграции);
		Если ПрошлыйТип <> ТипЗначения Тогда
			НаименованияТипов = ПолучитьНаименованиеТипаОбъектаПредставлениеОбъекта(ТипЗначения);
			Если НаименованияТипов = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаОбъекта.СозданОбновлен = Перечисления.пбп_СозданОбновлен.Создан
			Или СтрокаОбъекта.СозданОбновлен = Перечисления.пбп_СозданОбновлен.Обновлен Тогда
			ТекстСообщения = ПолучитьТекстСообщенияСозданОбновлен(СтрокаОбъекта, НаименованияТипов);
		ИначеЕсли СтрокаОбъекта.СозданОбновлен = Перечисления.пбп_СозданОбновлен.ОшибкаСоздания
			Или СтрокаОбъекта.СозданОбновлен = Перечисления.пбп_СозданОбновлен.ОшибкаОбновления Тогда
			ТекстСообщения = ПолучитьТекстСообщенияОшибкаСозданияОшибкаОбновления(СтрокаОбъекта, НаименованияТипов);
		Иначе
			ВызватьИсключение НСтр("ru = 'Не заполнен тип операции ""Создан/обновлен""';");
		КонецЕсли;
		
		ДобавитьЗаписьВПротоколОбмена(СтруктураЗаписиИстории, ТекстСообщения);
		
		ПрошлыйТип = ТипЗнч(СтрокаОбъекта.ОбъектИнтеграции);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьНаименованиеТипаОбъектаПредставлениеОбъекта(ТипЗначения)
	
	НаименованияТипов = Новый Структура;
	
	ТипЗначенияСтрокой = Строка(ТипЗначения);
	МассивСтрок = пбп_ПереадресацияКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТипЗначенияСтрокой, ".");
	Если Не МассивСтрок.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧастьТипа = МассивСтрок[0];
	Если СтрНачинаетсяС(ЧастьТипа, "Документ") Тогда
		НаименованиеТипаОбъекта = "Документ";
	ИначеЕсли СтрНачинаетсяС(ЧастьТипа, "ПланВидовХарактеристик") Тогда
		НаименованиеТипаОбъекта = "План видов характеристик";
	Иначе
		НаименованиеТипаОбъекта = "Справочник";
	КонецЕсли;
	
	МетаданныеТипа = Метаданные.НайтиПоТипу(ТипЗначения);
	Если ЗначениеЗаполнено(МетаданныеТипа.ПредставлениеОбъекта) Тогда
		ПредставлениеОбъекта = МетаданныеТипа.ПредставлениеОбъекта;
	Иначе
		ПредставлениеОбъекта = МетаданныеТипа.Синоним;
	КонецЕсли;
	
	ПредставлениеОбъекта = НРег(ПредставлениеОбъекта);
	
	НаименованияТипов.Вставить("НаименованиеТипаОбъекта", НаименованиеТипаОбъекта);
	НаименованияТипов.Вставить("ПредставлениеОбъекта"	, ПредставлениеОбъекта);
	
	Возврат НаименованияТипов;
	
КонецФункции

Функция ПолучитьТекстСообщенияСозданОбновлен(СтрокаОбъекта, НаименованияТипов)
	
	Действие = ?(СтрокаОбъекта.СозданОбновлен = Перечисления.пбп_СозданОбновлен.Создан, "создан", "обновлен");
	
	Если Не ПустаяСтрока(СтрокаОбъекта.ДополнительнаяИнформация) Тогда
		ТекстСообщения = СтрШаблон("ru = '%1 %2 %3 успешно %4. Подробнее: %5';",
			НаименованияТипов.НаименованиеТипаОбъекта, 
			НаименованияТипов.ПредставлениеОбъекта,
			Строка(СтрокаОбъекта.ОбъектИнтеграции),
			Действие,
			СтрокаОбъекта.ДополнительнаяИнформация);
	Иначе
		ТекстСообщения = СтрШаблон("ru = '%1 %2 %3 успешно %4';",
			НаименованияТипов.НаименованиеТипаОбъекта,
			НаименованияТипов.ПредставлениеОбъекта,
			Действие,
			Строка(СтрокаОбъекта.ОбъектИнтеграции));
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ПолучитьТекстСообщенияОшибкаСозданияОшибкаОбновления(СтрокаОбъекта, НаименованияТипов)
	
	Действие = ?(СтрокаОбъекта.СозданОбновлен = Перечисления.пбп_СозданОбновлен.ОшибкаСоздания,
		"создании", "обновлении");
	
	Если НРег(НаименованияТипов.НаименованиеТипаОбъекта) = "план видов характеристик" Тогда
		НаименованиеТипаВРодПадеже = "плана видов характеристик";
	Иначе
		НаименованиеТипаВРодПадеже = НРег(НаименованияТипов.НаименованиеТипаОбъекта) + "а";
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаОбъекта.ДополнительнаяИнформация) Тогда
		ТекстСообщения = СтрШаблон("ru = 'При %1 %2 %3 с идентификатором ""%4"" (%5) возникала ошибка. Подробнее: %6';",
			Действие,
			НаименованиеТипаВРодПадеже,
			НаименованияТипов.ПредставлениеОбъекта,
			СтрокаОбъекта.Идентификатор,
			СтрокаОбъекта.ТипИдентификатора,
			СтрокаОбъекта.ДополнительнаяИнформация);
	Иначе
		ТекстСообщения = СтрШаблон("ru = 'При %1 %2 %3 с идентификатором ""%4"" (%5) возникла ошибка';",
			Действие,
			НаименованиеТипаВРодПадеже,
			НаименованияТипов.ПредставлениеОбъекта,
			СтрокаОбъекта.Идентификатор,
			СтрокаОбъекта.ТипИдентификатора);
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Процедура ЗаполнитьНомераВерсийОбъектовИнтеграции(ДатаИнтеграции, Автор, ОбъектыИнтеграции)
	
	Если Не пбп_ОбщегоНазначенияПовтИсп.ПолучитьИспользованиеВерсионированияОбъектовОбмена() Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыИнтеграцииОтбор = ОбъектыИнтеграции.Скопировать();
	Дикримент = ОбъектыИнтеграцииОтбор.Количество() - 1;
	Пока Дикримент >= 0 Цикл
		Если Не (ОбъектыИнтеграцииОтбор[Дикримент].СозданОбновлен = Перечисления.пбп_СозданОбновлен.Создан
			Или ОбъектыИнтеграцииОтбор[Дикримент].СозданОбновлен = Перечисления.пбп_СозданОбновлен.Обновлен)
			Или Не ЗначениеЗаполнено(ОбъектыИнтеграцииОтбор[Дикримент].ОбъектИнтеграции) Тогда
			ОбъектыИнтеграцииОтбор.Удалить(Дикримент);
		КонецЕсли;
		
		Дикримент = Дикримент - 1;
	КонецЦикла;
	
	МассивОбъектов = пбп_ПереадресацияКлиентСервер.СвернутьМассив(
		ОбъектыИнтеграцииОтбор.ВыгрузитьКолонку("ОбъектИнтеграции"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"	, ДатаИнтеграции);
	Запрос.УстановитьПараметр("Автор"	, Автор);
	Запрос.УстановитьПараметр("Объекты"	, МассивОбъектов);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВерсииОбъектов.Объект КАК Объект,
	|	МАКСИМУМ(ВерсииОбъектов.ДатаВерсии) КАК ДатаВерсии,
	|	ВерсииОбъектов.АвторВерсии КАК АвторВерсии
	|ПОМЕСТИТЬ СрезПоследних
	|ИЗ
	|	#ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.Объект В(&Объекты)
	|	И ВерсииОбъектов.АвторВерсии = &Автор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВерсииОбъектов.Объект,
	|	ВерсииОбъектов.АвторВерсии
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВерсииОбъектов.ДатаВерсии) <= &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследних.Объект КАК Объект,
	|	ВерсииОбъектов.НомерВерсии КАК НомерВерсии
	|ИЗ
	|	СрезПоследних КАК СрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВерсииОбъектов КАК ВерсииОбъектов
	|		ПО СрезПоследних.Объект = ВерсииОбъектов.Объект
	|			И СрезПоследних.ДатаВерсии = ВерсииОбъектов.ДатаВерсии
	|			И СрезПоследних.АвторВерсии = ВерсииОбъектов.АвторВерсии";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВерсииОбъектов", "РегистрСведений.ВерсииОбъектов");
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
		СтруктураОтбора = Новый Структура("ОбъектИнтеграции", ВыборкаРезультатаЗапроса.Объект);
		НайденныеСтроки = ОбъектыИнтеграции.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			СтрокаТаблицы.НомерВерсии = ВыборкаРезультатаЗапроса.НомерВерсии;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
